IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_cm_mpu_regs.xml
<module id="MPU_REGS" HW_revision="" description="MPU Registers">
	<register id="MPU_CONTROL_REG" width="32" page="1" offset="0x0" internal="0" description="MPU control regster">
		<bitfield id="ENABLE" description="Global Enable register" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="ACC_VIO_INTEN" width="32" page="1" offset="0x20" internal="0" description="Access violation interrupt enable">
		<bitfield id="INTEN" description="Interrupt enable register" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="KEY to allow write access" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="ACC_VIO_FLAGS" width="32" page="1" offset="0x24" internal="0" description="Access violation flag register">
		<bitfield id="RD" description="Read access violation flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="WR" description="Write access violation flag" begin="1" end="1" width="1" rwaccess="R"/>
	</register>
	<register id="ACC_VIO_FLAGS_SET" width="32" page="1" offset="0x28" internal="0" description="Acesss violation set register">
		<bitfield id="RD" description="Read access violation flag set" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="WR" description="Write access violation flag set" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="KEY to allow write access" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="ACC_VIO_FLAGS_CLR" width="32" page="1" offset="0x2c" internal="0" description="Access violation clear register">
		<bitfield id="RD" description="Read access violation flag clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="WR" description="Write access violation flag clear" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="KEY to allow write access" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="ACC_VIO_ADDR_REG" width="32" page="1" offset="0x30" internal="0" description="Access violation address register">
		<bitfield id="VIOLATION_ADDRESS" description="Access violation address register" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="REGION0_STARTADDRESSS" width="32" page="1" offset="0x40" internal="0" description="Region 0 start address register">
		<bitfield id="START_ADDR" description="Start address of Region 0" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="REGION0_CONFIG" width="32" page="1" offset="0x44" internal="0" description="Region 0 configuration register">
		<bitfield id="ENABLE" description="Region Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PROT_TYPE" description="Access permission configuration bits" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="SIZE" description="Size of the region 0" begin="12" end="8" width="5" rwaccess="RW"/>
		<bitfield id="SUBREGION0_DISABLE" description="Sub region 0 disable bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION1_DISABLE" description="Sub region 1 disable bit" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION2_DISABLE" description="Sub region 2 disable bit" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION3_DISABLE" description="Sub region 3 disable bit" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION4_DISABLE" description="Sub region 4 disable bit" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION5_DISABLE" description="Sub region 5 disable bit" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION6_DISABLE" description="Sub region 6 disable bit" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION7_DISABLE" description="Sub region 7 disable bit" begin="23" end="23" width="1" rwaccess="RW"/>
	</register>
	<register id="REGION1_STARTADDRESSS" width="32" page="1" offset="0x48" internal="0" description="Region 1 start address register">
		<bitfield id="START_ADDR" description="Start address of Region 1" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="REGION1_CONFIG" width="32" page="1" offset="0x4c" internal="0" description="Region 1 configuration register">
		<bitfield id="ENABLE" description="Region Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PROT_TYPE" description="Access permission configuration bits" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="SIZE" description="Size of the region 1" begin="12" end="8" width="5" rwaccess="RW"/>
		<bitfield id="SUBREGION0_DISABLE" description="Sub region 0 disable bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION1_DISABLE" description="Sub region 1 disable bit" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION2_DISABLE" description="Sub region 2 disable bit" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION3_DISABLE" description="Sub region 3 disable bit" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION4_DISABLE" description="Sub region 4 disable bit" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION5_DISABLE" description="Sub region 5 disable bit" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION6_DISABLE" description="Sub region 6 disable bit" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION7_DISABLE" description="Sub region 7 disable bit" begin="23" end="23" width="1" rwaccess="RW"/>
	</register>
	<register id="REGION2_STARTADDRESSS" width="32" page="1" offset="0x50" internal="0" description="Region 2 start address register">
		<bitfield id="START_ADDR" description="Start address of Region 2" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="REGION2_CONFIG" width="32" page="1" offset="0x54" internal="0" description="Region 2 configuration register">
		<bitfield id="ENABLE" description="Region Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PROT_TYPE" description="Access permission configuration bits" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="SIZE" description="Size of the region 2" begin="12" end="8" width="5" rwaccess="RW"/>
		<bitfield id="SUBREGION0_DISABLE" description="Sub region 0 disable bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION1_DISABLE" description="Sub region 1 disable bit" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION2_DISABLE" description="Sub region 2 disable bit" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION3_DISABLE" description="Sub region 3 disable bit" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION4_DISABLE" description="Sub region 4 disable bit" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION5_DISABLE" description="Sub region 5 disable bit" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION6_DISABLE" description="Sub region 6 disable bit" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION7_DISABLE" description="Sub region 7 disable bit" begin="23" end="23" width="1" rwaccess="RW"/>
	</register>
	<register id="REGION3_STARTADDRESSS" width="32" page="1" offset="0x58" internal="0" description="Region 3 start address register">
		<bitfield id="START_ADDR" description="Start address of Region 3" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="REGION3_CONFIG" width="32" page="1" offset="0x5c" internal="0" description="Region 3 configuration register">
		<bitfield id="ENABLE" description="Region Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PROT_TYPE" description="Access permission configuration bits" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="SIZE" description="Size of the region 3" begin="12" end="8" width="5" rwaccess="RW"/>
		<bitfield id="SUBREGION0_DISABLE" description="Sub region 0 disable bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION1_DISABLE" description="Sub region 1 disable bit" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION2_DISABLE" description="Sub region 2 disable bit" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION3_DISABLE" description="Sub region 3 disable bit" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION4_DISABLE" description="Sub region 4 disable bit" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION5_DISABLE" description="Sub region 5 disable bit" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION6_DISABLE" description="Sub region 6 disable bit" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION7_DISABLE" description="Sub region 7 disable bit" begin="23" end="23" width="1" rwaccess="RW"/>
	</register>
	<register id="REGION4_STARTADDRESSS" width="32" page="1" offset="0x60" internal="0" description="Region 4 start address register">
		<bitfield id="START_ADDR" description="Start address of Region 4" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="REGION4_CONFIG" width="32" page="1" offset="0x64" internal="0" description="Region 4 configuration register">
		<bitfield id="ENABLE" description="Region Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PROT_TYPE" description="Access permission configuration bits" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="SIZE" description="Size of the region 4" begin="12" end="8" width="5" rwaccess="RW"/>
		<bitfield id="SUBREGION0_DISABLE" description="Sub region 0 disable bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION1_DISABLE" description="Sub region 1 disable bit" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION2_DISABLE" description="Sub region 2 disable bit" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION3_DISABLE" description="Sub region 3 disable bit" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION4_DISABLE" description="Sub region 4 disable bit" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION5_DISABLE" description="Sub region 5 disable bit" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION6_DISABLE" description="Sub region 6 disable bit" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION7_DISABLE" description="Sub region 7 disable bit" begin="23" end="23" width="1" rwaccess="RW"/>
	</register>
	<register id="REGION5_STARTADDRESSS" width="32" page="1" offset="0x68" internal="0" description="Region 5 start address register">
		<bitfield id="START_ADDR" description="Start address of Region 4" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="REGION5_CONFIG" width="32" page="1" offset="0x6c" internal="0" description="Region 5 configuration register">
		<bitfield id="ENABLE" description="Region Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PROT_TYPE" description="Access permission configuration bits" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="SIZE" description="Size of the region 5" begin="12" end="8" width="5" rwaccess="RW"/>
		<bitfield id="SUBREGION0_DISABLE" description="Sub region 0 disable bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION1_DISABLE" description="Sub region 1 disable bit" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION2_DISABLE" description="Sub region 2 disable bit" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION3_DISABLE" description="Sub region 3 disable bit" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION4_DISABLE" description="Sub region 4 disable bit" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION5_DISABLE" description="Sub region 5 disable bit" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION6_DISABLE" description="Sub region 6 disable bit" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION7_DISABLE" description="Sub region 7 disable bit" begin="23" end="23" width="1" rwaccess="RW"/>
	</register>
	<register id="REGION6_STARTADDRESSS" width="32" page="1" offset="0x70" internal="0" description="Region 6 start address register">
		<bitfield id="START_ADDR" description="Start address of Region 6" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="REGION6_CONFIG" width="32" page="1" offset="0x74" internal="0" description="Region 6 configuration register">
		<bitfield id="ENABLE" description="Region Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PROT_TYPE" description="Access permission configuration bits" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="SIZE" description="Size of the region 6" begin="12" end="8" width="5" rwaccess="RW"/>
		<bitfield id="SUBREGION0_DISABLE" description="Sub region 0 disable bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION1_DISABLE" description="Sub region 1 disable bit" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION2_DISABLE" description="Sub region 2 disable bit" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION3_DISABLE" description="Sub region 3 disable bit" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION4_DISABLE" description="Sub region 4 disable bit" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION5_DISABLE" description="Sub region 5 disable bit" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION6_DISABLE" description="Sub region 6 disable bit" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION7_DISABLE" description="Sub region 7 disable bit" begin="23" end="23" width="1" rwaccess="RW"/>
	</register>
	<register id="REGION7_STARTADDRESSS" width="32" page="1" offset="0x78" internal="0" description="Region 7 start address register">
		<bitfield id="START_ADDR" description="Start address of Region 7" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="REGION7_CONFIG" width="32" page="1" offset="0x7c" internal="0" description="Region 7 configuration register">
		<bitfield id="ENABLE" description="Region Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PROT_TYPE" description="Access permission configuration bits" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="SIZE" description="Size of the region 7" begin="12" end="8" width="5" rwaccess="RW"/>
		<bitfield id="SUBREGION0_DISABLE" description="Sub region 0 disable bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION1_DISABLE" description="Sub region 1 disable bit" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION2_DISABLE" description="Sub region 2 disable bit" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION3_DISABLE" description="Sub region 3 disable bit" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION4_DISABLE" description="Sub region 4 disable bit" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION5_DISABLE" description="Sub region 5 disable bit" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION6_DISABLE" description="Sub region 6 disable bit" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="SUBREGION7_DISABLE" description="Sub region 7 disable bit" begin="23" end="23" width="1" rwaccess="RW"/>
	</register>
</module>
